$(document).ready(function(){

        $('#email').mask('AAAAAAA@AA.AAA', { translation: { 'A': { pattern: /[\w@\-.+]/ } } }); 
        // Подключаем маску для номера телефона (формат +7 XXX XXX XX XX)
        $('#phone').mask('+7 000 000 00 00');

        // Подключаем маску для номера банковской карты (формат XXXX XXXX XXXX XXXX)
        $('#cardNumber').mask('0000 0000 0000 0000');
    
        // Подключаем маску для даты срока действия карты (формат MM/ГГ)
        $('#expiryDate').mask('00/00');
    
        // $('#email').mask('([a-zA-Z0-9_\-\.]+)@([a-zA-Z0-9_\-\.]+)\.([a-zA-Z]{2,5})'); 
    
        // Подключаем маску для CVV кода карты (трёхзначное число)
        $('#cvv').mask('000');

});